[
    "Chasing the Yeti - A Mountain Bike Movie Review",
    "Yeti SB100 C GX in review ",
    "In Short, Yeti's SB150 is an Aggressive Mountain Bike for Aggressive Riders [review] ",
    "Yeti SB150",
    "Summer Mountain Bike Reviews: Salsa, Orbea, Yeti, Viathon, Fezzari, Diamondback [Podcast] ",
    "Yeti Replaces The SB5 With The New SB140 27.5\" Trail Bike, Discontinues the Beti Bike Line ",
    "First Ride: Yeti SB140",
    "Yeti SB140 First Ride Review – Time To Rip ",
    "Yeti's SB150 Race Sled: First Impressions ",
    "First Ride: Yeti SB165 ",
    "Crankworx, Whistler, and the Future of Slopestyle, with Darren Kinnaird ",
    "Whistler is fun!",
    "A Morning on the Microclimate Mountain Bike Trail in Whistler ",
    "Video: Orbea's Enduro Team Unleashes Their Fury in Whistler ",
    "Danny Hart Does Whistler",
    "Watch: Riding the Scariest Features at Whistler Bike Park ",
    "Watch: One Week In Paradise - GT Athletes Take on Crankworx, Whistler ",
    "The Perfect Bike for Whistler - Video ",
    "Miss Fire, Whistler",
    "Camworx: A Day with Cam Zink at Crankworx Whistler",
    "Jackson Goldstone Blitzes the Whistler Bike Park | #IRIDEENVE",
    "2020 Giant Reign 29er: A Whistler Test Ride Review ",
    "Ride Top of the World in Whistler Bike Park, Where You Can Choose Your own Epic ",
    "How to Do Whistler for the First Time (in the Middle of Crankworx)",
    "Watch: 2020 Santa Cruz Tallboy, Tested in Whistler [Review] ",
    "Dropping Into Whistler's Dark Crystal [Trail Report] ",
    "Giant Bicycles Crankworx Whistler Recap",
    "Take a Ride On Stage One of the Enduro Wold Series, Whistler",
    "A Quarter Century of Trying Hard | Whistler Wonderland.",
    "Watch the Most Creative Riding at Whistler Bike Park",
    "2019 Whip-Off World Champs Crankworx Whistler",
    "[Photos] The Wildest Whips from Crankworx Whistler Whip-Off World Championships ",
    "PIT BITS - Crankworx Whistler - New Five Ten Trailcross Shoes",
    "Big, Bad Whistler - Enduro World Series Race Show",
    "And your Crankworx Whistler Enduro World Series Winners Are...",
    "FINAL RESULTS: Richie Rude and Isabeau Courdurier Win EWS Whistler",
    "Enduro World Series, Round 6, Crankworx Whistler Course Preview.",
    "Whistler Trail Build: Midgard and MissFire, Start to Finish in Photos ",
    "Enduro World Series, Asia - Pacific | Coming Back to Derby - Flow Mountain Bike",
    "Enduro World Series Works With UCI to add eMTB Category for 2020 ",
    "Enduro World Series launches EWS-E!",
    "Behind the Scenes of Sam Hill's Third Enduro World Series Title.",
    "Watch the Highlights from the Final Enduro World Series in Zermatt.",
    "Enduro World Series—2019 Champions Crowned ",
    "Results & Video: Enduro World Series Finals—Zermatt, Switzerland ",
    "Enduro World Series Finals - Zermatt Race Slideshow",
    "Vital RAW - 2019 Enduro World Series, Zermatt Switzerland",
    "In the Shadow of the Matterhorn - 2019 Enduro World Series Zermatt - Recon",
    "15,000 Feet of Descending in a Day! 2019 Enduro World Series Course Previews, Zermatt, Switzerland",
    "Enduro World Series Northstar California: The Closest Race in EWS History ",
    "2019 Enduro World Series | Round 6, Northstar Highlights.",
    "DOWN TO THE WIRE! Enduro World Series Northstar Race Show",
    "FINAL RACE DAY - Vital RAW 2019 Enduro World Series Northstar",
    "Vital RAW - Race Day 1, Enduro World Series Northstar",
    "Enduro World Series Northstar Race Day 1 Slideshow",
    "2019 Enduro World Series | Round 7, Northstar | Course Preview.",
    "Vital RAW - ENDURO WORLD SERIES NORTHSTAR 2019",
    "SB165 27.5 DH Bike? PIT BITS - Enduro World Series, Northstar",
    "LOOK AT THE DUST! Enduro World Series Northstar Stage POV 2019",
    "Vital RAW - 2019 ENDURO WORLD SERIES WHISTLER!"
]